Конфигурация/Documents/СписаниеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Documents/СписаниеТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование: разрешить использование сканера
	ИспользоватьПодключаемоеОборудование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытии(Отказ)
	
	// Инициализация формы
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Проведен Тогда
		// Если документ уже проведен, форма только для просмотра
		Элементы.Товары.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииНаКлиенте(Отказ)
	
	// ПодключаемоеОборудование: подключение сканера штрихкодов при открытии формы
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование: отключение оборудования при закрытии формы
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" И Источник = "ПодключаемоеОборудование" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Штрихкод") Тогда
			ОбработатьШтрихкодСканера(Параметр.Штрихкод);
		ИначеЕсли ТипЗнч(Параметр) = Тип("Массив") И Параметр.Количество() > 0 Тогда
			ОбработатьШтрихкодСканера(Параметр[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Контроль заполнения обязательных реквизитов
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан склад!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// Контроль заполнения товаров
	Если Объект.Товары.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указаны товары для списания!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		// При изменении номенклатуры сбросим количество для переввода
		ТекущиеДанные.Количество = 0;
		// Очищаем штрихкод
		ТекущиеДанные.Штрихкод = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТоварыШтрихкодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на пустой штрихкод
	Если ПустаяСтрока(ТекущиеДанные.Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск номенклатуры по штрихкоду
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(ТекущиеДанные.Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		
		// Товар не найден - показываем предупреждение
		Ждать ПредупреждениеАсинх("Товар с штрихкодом """ + ТекущиеДанные.Штрихкод + """ не найден!");
		ТекущиеДанные.Штрихкод = "";
		Возврат;
		
	КонецЕсли;
	
	// Заполняем номенклатуру
	ТекущиеДанные.Номенклатура = НайденнаяНоменклатура;
	
	// Сбрасываем количество для переввода
	ТекущиеДанные.Количество = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// Получаем текущую строку таблицы
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, что номенклатура заполнена
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, что склад заполнен
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ТекущиеДанные.Количество = 0;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сначала укажите склад!";
		Сообщение.Поле = "Объект.Склад";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// Контроль отрицательного количества
	Если ТекущиеДанные.Количество < 0 Тогда
		ТекущиеДанные.Количество = 0;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Количество не может быть отрицательным!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// Если количество = 0, не проверяем остаток
	Если ТекущиеДанные.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем остаток на сервере, передавая скалярные значения
	РезультатПроверки = ПроверитьОстатокТовара(
		ТекущиеДанные.Номенклатура,
		Объект.Склад,
		Объект.Дата,
		ТекущиеДанные.Количество);
	
	// Если остаток недостаточный, обновляем количество
	Если РезультатПроверки.ОстатокНедостаточен Тогда
		ТекущиеДанные.Количество = РезультатПроверки.МаксимальноеКоличество;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоШтрихкоду(Штрихкод)
	
	// Поиск в регистре Штрихкоды
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Номенклатура;
	
КонецФункции

&НаСервере
Функция ПроверитьОстатокТовара(Номенклатура, Склад, Дата, Количество)
	
	// Получаем остаток товара на складе
	Остаток = ПолучитьОстатокТовара(Номенклатура, Склад, Дата);
	
	// Результат проверки
	Результат = Новый Структура("ОстатокНедостаточен, МаксимальноеКоличество, Остаток");
	Результат.ОстатокНедостаточен = Ложь;
	Результат.МаксимальноеКоличество = Количество;
	Результат.Остаток = Остаток;
	
	// Проверяем достаточность остатка
	Если Количество > Остаток Тогда
		
		Результат.ОстатокНедостаточен = Истина;
		Результат.МаксимальноеКоличество = Остаток;
		
		// Показываем предупреждение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			"Недостаточно товара ""%1"" на складе ""%2"".""|
			|Попытка списать: %3 %4|
			|В наличии: %5 %4|
			|Количество сокращено до доступного остатка.",
			Номенклатура,
			Склад,
			Количество,
			ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура),
			Остаток);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОстатокТовара(Номенклатура, Склад, Дата)
	
	// Если параметры не заполнены, возвращаем 0
	Если Не ЗначениеЗаполнено(Номенклатура) ИЛИ Не ЗначениеЗаполнено(Склад) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|		&Дата,
		|		Номенклатура = &Номенклатура
		|			И Склад = &Склад) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Остаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат "шт.";
	КонецЕсли;
	
	// Простое получение единицы измерения
	Возврат "шт.";
	
КонецФункции

// Обработка штрихкода от аппаратного сканера.
// Ищет товар, добавляет строку в ТЧ или увеличивает количество.
// Если товар не найден — предлагает создать новый.
//
&НаКлиенте
Процедура ОбработатьШтрихкодСканера(Штрихкод)
	
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск номенклатуры по штрихкоду
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		// Товар не найден — предлагаем создать новый
		ДопПараметры = Новый Структура("Штрихкод", Штрихкод);
		Оповещение = Новый ОписаниеОповещения("СоздатьНовыйТоварОтвет", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение,
			"Товар с штрихкодом """ + Штрихкод + """ не найден." + Символы.ПС + "Создать новый товар?",
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	// Добавляем найденный товар в ТЧ
	ДобавитьТоварВТабличнуюЧасть(НайденнаяНоменклатура, Штрихкод);
	
КонецПроцедуры

// Ответ на вопрос о создании нового товара (вызов из сканера).
//
&НаКлиенте
Процедура СоздатьНовыйТоварОтвет(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	// Открываем форму номенклатуры с предзаполненным штрихкодом
	ПараметрыФормы = Новый Структура("ИсходныйШтрихкод", ДопПараметры.Штрихкод);
	Оповещение = Новый ОписаниеОповещения("ПослеСозданияНоменклатуры", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

// Обработка закрытия формы номенклатуры — добавляем созданный товар в ТЧ.
//
&НаКлиенте
Процедура ПослеСозданияНоменклатуры(Результат, ДопПараметры) Экспорт
	
	// Пытаемся найти только что созданный товар по штрихкоду
	НайденнаяНоменклатура = НайтиНоменклатуруПоШтрихкоду(ДопПараметры.Штрихкод);
	
	Если НайденнаяНоменклатура = Неопределено Тогда
		// Пользователь закрыл форму без сохранения
		Возврат;
	КонецЕсли;
	
	// Добавляем созданный товар в ТЧ
	ДобавитьТоварВТабличнуюЧасть(НайденнаяНоменклатура, ДопПараметры.Штрихкод);
	
КонецПроцедуры

// Добавление товара в ТЧ Товары или увеличение количества.
//
&НаКлиенте
Процедура ДобавитьТоварВТабличнуюЧасть(НоменклатураСсылка, Штрихкод)
	
	// Поиск существующей строки с таким товаром
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если СтрокаТЧ.Номенклатура = НоменклатураСсылка Тогда
			СтрокаТЧ.Количество = СтрокаТЧ.Количество + 1;
			Элементы.Товары.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
			Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Товар ещё не в таблице — добавляем новую строку
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = НоменклатураСсылка;
	НоваяСтрока.Штрихкод = Штрихкод;
	НоваяСтрока.Количество = 1;
	
	Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличество;
	
КонецПроцедуры

#КонецОбласти
